Examples/EOFexample/2D_TMFHartmann/0/JxB
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      JxB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -2 -2 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    Inlet
    {
        type            zeroGradient;
        value           uniform (0 0 0);
    }
    Outlet
    {
        type            zeroGradient;
        value           uniform (0 0 0);
    }
    walls
    {
        type            zeroGradient;
        value           uniform (0 0 0);
    }
	Others
	{
	type					empty;
	}
}


// ************************************************************************* //
