Examples/EOFexample/2D_TMFHartmann/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Inlet
    {
		type            	fixedProfile;
		profile         polynomial
        (
            ((10.5 0 0)        (0 0 0))
            ((-4200 0 0)    (2 0 0))
        );
        direction       (0 1 0);
        origin          0;
    }
	
    Outlet
    {
	//type            fixedValue;
        //value           uniform (0 0 0);
        type            zeroGradient;
    }
    walls
    {
	type            fixedValue;
        value           uniform (0 0 0);
        //type            fixedValue;
        //value           uniform (0 0 0);
    }
	Others
	{
	type					empty;
	}
}


// ************************************************************************* //
