Examples/EOFexample/2D_TMFHartmann/0/mag(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mag(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    Inlet
    {
        type            calculated;
        value           uniform 2;
    }
    Outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
