Examples/EOFexample/2D_TMFHartmann/0/v2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      v2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.25;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    Outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            v2WallFunction;
        value           $internalField;
    }
	Others
	{
	type					empty;
	}
}



// ************************************************************************* //
