Examples/EOFexample/2D_TMFHartmann/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    Outlet
    {
        type            patch;
        nFaces          70;
        startFace       13830;
    }
    Inlet
    {
        type            patch;
        nFaces          70;
        startFace       13900;
    }
    Others
    {
        type            empty;
        nFaces          200;
        startFace       13970;
    }
    walls
    {
        type            wall;
        nFaces          14000;
        startFace       14170;
    }
)

// ************************************************************************* //
