Examples/EOFexample/2D_TMFHartmann/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

nu              nu [0 2 -1 0 0 0 0] 9.645e-7;
rho             rho [1 -3 0 0 0 0 0] 1576;
elcond_melt	elcond_melt [-1 -3 3 0 0 2 0] 1;
frequency	50;
maxRelDiff	0.5;
sendVelocity	1;
// ************************************************************************* //
